using System;
using MyLibrary;

namespace LabWork_10
{
    public class Program
    {
        static void Main(string[] args)
        {
            int cmd;
            do
            {
                PrintMenu();

                cmd = Input.Integer("Команда > ", "Неизвестная команда", 0, 2);

                DoAction(cmd);
            } while (cmd != 0);
        }

        static void PrintMenu() => Console.WriteLine("1. Демонстрация наследования\n2. Демонстрация интерфейса\n\n0. Выход\n");

        static void DoAction(int cmd)
        {
            switch (cmd)
            {
                case 1: Output.Clear(); InheritanceExample.Start(); break;
                case 2: Output.Clear(); InterfaceExample.Start(); break;

                case 0: return;
            }
        }

        public static void FillRandom(out string name, out string region, out string city, out string street, out int population, out int houses, out int houseNumber)
        {
            string[] regions = new string[] { "Алтайский край", "Амурская область", "Архангельская область", "Астраханская область", "Белгородская область", "Брянская область",
                                              "Владимирская область", "Волгоградская область", "Вологодская область", "Воронежская область", "г. Москва", "Еврейская автономная область",
                                              "Забайкальский край", "Ивановская область", "Иные территории, включая город и космодром Байконур", "Иркутская область",
                                              "Кабардино-Балкарская Республика", "Калининградская область", "Калужская область", "Камчатский край", "Карачаево-Черкесская Республика",
                                              "Кемеровская область - Кузбасс", "Кировская область", "Костромская область", "Краснодарский край", "Красноярский край", "Курганская область",
                                              "Курская область", "Ленинградская область", "Липецкая область", "Магаданская область", "Московская область", "Мурманская область",
                                              "Ненецкий автономный округ", "Нижегородская область", "Новгородская область", "Новосибирская область", "Омская область",
                                              "Оренбургская область", "Орловская область", "Пензенская область", "Пермский край", "Приморский край", "Псковская область",
                                              "Республика Адыгея (Адыгея)", "Республика Алтай", "Республика Башкортостан", "Республика Бурятия", "Республика Дагестан",
                                              "Республика Ингушетия", "Республика Калмыкия", "Республика Карелия", "Республика Коми", "Республика Крым", "Республика Марий Эл",
                                              "Республика Мордовия", "Республика Саха (Якутия)", "Республика Северная Осетия - Алания", "Республика Татарстан (Татарстан)",
                                              "Республика Тыва", "Республика Хакасия", "Ростовская область", "Рязанская область", "Самарская область", "Санкт-Петербург",
                                              "Саратовская область", "Сахалинская область", "Свердловская область", "Севастополь", "Смоленская область", "Ставропольский край",
                                              "Тамбовская область", "Тверская область", "Томская область", "Тульская область", "Тюменская область", "Удмуртская Республика",
                                              "Ульяновская область", "Хабаровский край", "Ханты-Мансийский автономный округ - Югра", "Челябинская область", "Чеченская Республика",
                                              "Чувашская Республика - Чувашия", "Чукотский автономный округ", "Ямало-Ненецкий автономный округ", "Ярославская область" };

            name = Rand.Choice(new string[] { "Библиотека", "Жилое здание", "Стройка", "Торговый центр", "Поликлинника", "Арт-объект", "Музей", "Учебное заведение" });
            region = Rand.Choice(regions);
            city = Rand.Choice(new string[] { "Пермь", "Москва", "Санкт-Петербург", "Березники", "Нытва", "Красновишерск", "Балашиха", "Дубна", "Сясьтрой", "Тихвин", "Тосно", "Выборг" });
            street = Rand.Choice(new string[] { "Ленина", "Пушкина", "Хабаровская", "Победы", "Краснозамённая", "Центральная", "Набережная", "Высокая" });
            houses = Rand.Integer(1, 10000);
            houseNumber = Rand.Integer(1, 201);
            population = Rand.Integer(100000, 15000000);
        }
    }
}